name: "resnet_cifar10"
layer {
  name: "dummy2"
  type: "DummyData"
  top: "data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    scale: 0.00392156862745
    mirror: true
    crop_size: 64
    mean_value: 11
    mean_value: 123
    mean_value: 212
  }
  dummy_data_param {
    data_filler {
      type: "msra"
    }
    data_filler {
      type: "constant"
      value: 0
    }
    shape {
      dim: 1
      dim: 3
      dim: 112
      dim: 112
    }
    shape {
      dim: 1
    }
  }
}
layer {
  name: "Convolution1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1
    decay_mult: 1
  }
  param {
    lr_mult: 2
    decay_mult: 0
  }
  convolution_param {
    num_output: 16
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.01
    }
    bias_filler {
      type: "constant"
      value: 0
    }
    engine: CUDNN
  }
}
layer {
  name: "Pooling1"
  type: "Pooling"
  bottom: "conv1"
  top: "pool1"
  pooling_param {
    pool: AVE
    engine: CUDNN
    global_pooling: true
  }
}
layer {
  name: "Loss1"
  type: "Python"
  bottom: "pool1"
  bottom: "label"
  top: "loss"
  python_param {
    module: "python_accuracy"
    layer: "PythonAccuracy"
    param_str: "{ \"param_name\": param_value }"
  }
}

